IDENTIFICATION DIVISION.
PROGRAM-ID. SEU_PROGRAMA.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARQUIVO-ENTRADA ASSIGN TO 'ENTRADA.DAT'
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT ARQUIVO-SAIDA ASSIGN TO 'SAIDA.DAT'
        ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD  ARQUIVO-ENTRADA.
01  REGISTRO-ENTRADA PIC X(100).
FD  ARQUIVO-SAIDA.
01  REGISTRO-SAIDA PIC X(100).
WORKING-STORAGE SECTION.
01  VARIAVEIS-WORK.
    05 WS-CONTADOR PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
ABRIR-ARQUIVOS.
    OPEN INPUT ARQUIVO-ENTRADA.
    OPEN OUTPUT ARQUIVO-SAIDA.
LER-REGISTRO.
    READ ARQUIVO-ENTRADA INTO REGISTRO-ENTRADA
        AT END GO TO FECHAR-ARQUIVOS.
    MOVE REGISTRO-ENTRADA TO REGISTRO-SAIDA.
    WRITE REGISTRO-SAIDA.
    ADD 1 TO WS-CONTADOR.
    GO TO LER-REGISTRO.
FECHAR-ARQUIVOS.
    CLOSE ARQUIVO-ENTRADA ARQUIVO-SAIDA.
    STOP RUN.
