IDENTIFICATION DIVISION.
PROGRAM-ID. ARVORE-AVL-COMPLETA.

DATA DIVISION.
WORKING-STORAGE SECTION.

*---------------------*
* Controle da Árvore  *
*---------------------*
01  CONTROLE-ARVORE.
    05 INDICE-RAIZ           PIC 9(03) VALUE 0.
    05 TOTAL-NOS             PIC 9(03) VALUE 0.
    05 PROX-INDICE-LIVRE     PIC 9(03) VALUE 1.

*----------------------*
* Declaração dos Nós   *
*----------------------*
01  ARVORE.
    05 NODOS OCCURS 100 TIMES INDEXED BY IDX.
        10 VALOR             PIC 9(04).
        10 IND-ESQUERDA      PIC 9(03) VALUE 0.
        10 IND-DIREITA       PIC 9(03) VALUE 0.
        10 ALTURA            PIC 9(02) VALUE 1.

*------------------------*
* Variáveis auxiliares   *
*------------------------*
01  ENTRADA-VALOR          PIC 9(04).
01  ESCOLHA                PIC 9(01).
01  NIVEL                  PIC 9(02).
01  BALANCO                PIC S9(02).
01  TEMP                   PIC 9(03).
01  ENCONTRADO             PIC X VALUE 'N'.

PROCEDURE DIVISION.
PRINCIPAL.
    DISPLAY "*** IMPLEMENTAÇÃO COMPLETA DE ÁRVORE AVL EM COBOL ***".

    PERFORM ATE ESCOLHA = '0'
        DISPLAY " "
        DISPLAY "1. Inserir valor"
        DISPLAY "2. Buscar valor"
        DISPLAY "3. Visualizar árvore (formato árvore)"
        DISPLAY "0. Sair"
        DISPLAY "Escolha: " WITH NO ADVANCING
        ACCEPT ESCOLHA

        EVALUATE ESCOLHA
            WHEN '1'
                PERFORM INSERIR-VALOR
            WHEN '2'
                PERFORM BUSCAR-VALOR
            WHEN '3'
                PERFORM MOSTRAR-ARVORE
            WHEN '0'
                DISPLAY "Saindo do programa."
            WHEN OTHER
                DISPLAY "Opção inválida."
        END-EVALUATE
    END-PERFORM.

    STOP RUN.

*-----------------------------*
* INSERÇÃO COM BALANCEAMENTO *
*-----------------------------*
INSERIR-VALOR.
    DISPLAY "Digite o valor a inserir: " WITH NO ADVANCING
    ACCEPT ENTRADA-VALOR

    PERFORM INSERIR-USANDO INDICE-RAIZ ENTRADA-VALOR.

INSERIR-USANDO USING INDICE VALOR-IN.
    IF INDICE = 0
        MOVE PROX-INDICE-LIVRE TO INDICE
        MOVE VALOR-IN TO VALOR OF NODOS (INDICE)
        MOVE 0 TO IND-ESQUERDA OF NODOS (INDICE)
        MOVE 0 TO IND-DIREITA OF NODOS (INDICE)
        MOVE 1 TO ALTURA OF NODOS (INDICE)
        ADD 1 TO TOTAL-NOS
        ADD 1 TO PROX-INDICE-LIVRE
        MOVE INDICE TO INDICE-RAIZ
    ELSE
        IF VALOR-IN < VALOR OF NODOS (INDICE)
            PERFORM INSERIR-USANDO USING IND-ESQUERDA OF NODOS (INDICE) VALOR-IN
        ELSE IF VALOR-IN > VALOR OF NODOS (INDICE)
            PERFORM INSERIR-USANDO USING IND-DIREITA OF NODOS (INDICE) VALOR-IN
        ELSE
            DISPLAY "Valor já existe."
            EXIT PARAGRAPH
        END-IF

        PERFORM ATUALIZAR-ALTURA USING INDICE
        PERFORM BALANCEAR-NO USING INDICE
    END-IF.

*-----------------------------*
* ATUALIZA ALTURA DO NÓ      *
*-----------------------------*
ATUALIZAR-ALTURA USING INDICE.
    MOVE FUNCTION MAX( ALTURA-NO(IND-ESQUERDA OF NODOS (INDICE))
                     , ALTURA-NO(IND-DIREITA OF NODOS (INDICE)) )
        TO TEMP
    ADD 1 TO TEMP
    MOVE TEMP TO ALTURA OF NODOS (INDICE).

*-----------------------------*
* FUNÇÃO ALTURA DE NÓ        *
*-----------------------------*
ALTURA-NO FUNCTION USING INDICE.
    IF INDICE = 0
        RETURN 0
    ELSE
        RETURN ALTURA OF NODOS (INDICE)
    END-IF.

*-----------------------------*
* BALANCEAMENTO DE NÓ        *
*-----------------------------*
BALANCEAR-NO USING INDICE.
    COMPUTE BALANCO = ALTURA-NO(IND-ESQUERDA OF NODOS (INDICE))
                    - ALTURA-NO(IND-DIREITA OF NODOS (INDICE))

    IF BALANCO > 1
        IF ENTRADA-VALOR < VALOR OF NODOS (IND-ESQUERDA OF NODOS (INDICE))
            PERFORM ROTACIONAR-DIREITA USING INDICE
        ELSE
            PERFORM ROTACIONAR-ESQUERDA USING IND-ESQUERDA OF NODOS (INDICE)
            PERFORM ROTACIONAR-DIREITA USING INDICE
        END-IF
    ELSE IF BALANCO < -1
        IF ENTRADA-VALOR > VALOR OF NODOS (IND-DIREITA OF NODOS (INDICE))
            PERFORM ROTACIONAR-ESQUERDA USING INDICE
        ELSE
            PERFORM ROTACIONAR-DIREITA USING IND-DIREITA OF NODOS (INDICE)
            PERFORM ROTACIONAR-ESQUERDA USING INDICE
        END-IF.

*-----------------------------*
* ROTACIONAR À DIREITA       *
*-----------------------------*
ROTACIONAR-DIREITA USING INDICE.
    MOVE IND-ESQUERDA OF NODOS (INDICE) TO TEMP
    MOVE IND-DIREITA OF NODOS (TEMP) TO IND-ESQUERDA OF NODOS (INDICE)
    MOVE INDICE TO IND-DIREITA OF NODOS (TEMP)
    PERFORM ATUALIZAR-ALTURA USING INDICE
    PERFORM ATUALIZAR-ALTURA USING TEMP
    MOVE TEMP TO INDICE.

*-----------------------------*
* ROTACIONAR À ESQUERDA      *
*-----------------------------*
ROTACIONAR-ESQUERDA USING INDICE.
    MOVE IND-DIREITA OF NODOS (INDICE) TO TEMP
    MOVE IND-ESQUERDA OF NODOS (TEMP) TO IND-DIREITA OF NODOS (INDICE)
    MOVE INDICE TO IND-ESQUERDA OF NODOS (TEMP)
    PERFORM ATUALIZAR-ALTURA USING INDICE
    PERFORM ATUALIZAR-ALTURA USING TEMP
    MOVE TEMP TO INDICE.

*-----------------------------*
* BUSCA                      *
*-----------------------------*
BUSCAR-VALOR.
    DISPLAY "Digite o valor a buscar: " WITH NO ADVANCING
    ACCEPT ENTRADA-VALOR
    MOVE 'N' TO ENCONTRADO
    PERFORM BUSCAR-USANDO USING INDICE-RAIZ ENTRADA-VALOR
    IF ENCONTRADO = 'S'
        DISPLAY "Valor encontrado!"
    ELSE
        DISPLAY "Valor não encontrado."
    END-IF.

BUSCAR-USANDO USING INDICE VAL.
    IF INDICE = 0
        EXIT PARAGRAPH
    ELSE IF VAL = VALOR OF NODOS (INDICE)
        MOVE 'S' TO ENCONTRADO
    ELSE IF VAL < VALOR OF NODOS (INDICE)
        PERFORM BUSCAR-USANDO USING IND-ESQUERDA OF NODOS (INDICE) VAL
    ELSE
        PERFORM BUSCAR-USANDO USING IND-DIREITA OF NODOS (INDICE) VAL
    END-IF.

*-----------------------------*
* VISUALIZAÇÃO DA ÁRVORE     *
*-----------------------------*
MOSTRAR-ARVORE.
    IF INDICE-RAIZ = 0
        DISPLAY "Árvore está vazia."
    ELSE
        DISPLAY "Visualização da Árvore:"
        PERFORM IMPRIMIR-ARVORE USING INDICE-RAIZ 0
    END-IF.

IMPRIMIR-ARVORE USING INDICE NIVEL.
    IF INDICE = 0
        EXIT PARAGRAPH
    END-IF

    PERFORM IMPRIMIR-ARVORE USING IND-DIREITA OF NODOS (INDICE) NIVEL + 1

    PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > NIVEL
        DISPLAY "    " WITH NO ADVANCING
    END-PERFORM
    DISPLAY VALOR OF NODOS (INDICE)

    PERFORM IMPRIMIR-ARVORE USING IND-ESQUERDA OF NODOS (INDICE) NIVEL + 1.
