IDENTIFICATION DIVISION.
PROGRAM-ID. BUBBLE-SORT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  ARR-SIZE          PIC 9(2) VALUE 5.
01  ARR               PIC 9(3) OCCURS 5 TIMES.
    88 SORTED         VALUE 1 THRU 999.
01  I                PIC 9(2).
01  J                PIC 9(2).
01  TEMP             PIC 9(3).
    
PROCEDURE DIVISION.
    MOVE 034 TO ARR(1).
    MOVE 012 TO ARR(2).
    MOVE 045 TO ARR(3).
    MOVE 023 TO ARR(4).
    MOVE 009 TO ARR(5).

    PERFORM VARYING I FROM 1 BY 1 UNTIL I = ARR-SIZE
        PERFORM VARYING J FROM 1 BY 1 UNTIL J = ARR-SIZE - I + 1
            IF ARR(J) > ARR(J + 1) THEN
                MOVE ARR(J) TO TEMP
                MOVE ARR(J + 1) TO ARR(J)
                MOVE TEMP TO ARR(J + 1)
            END-IF
        END-PERFORM
    END-PERFORM.

    DISPLAY "ARRAY ORDENADO:".
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARR-SIZE
        DISPLAY ARR(I)
    END-PERFORM.

    STOP RUN.
